Repository: privat/ikiwiki
Catalog: po/underlays/basewiki/ikiwiki/pagespec.*.po
Languages: de, es

source: To select a set of pages, such as pages that are locked, pages whose commit emails you want subscribe to, or pages to combine into a blog, the wiki uses a PageSpec. This is an expression that matches a set of pages.
de: Um eine Menge von Seiten auszuwählen (etwa Seiten, die gesperrt werden sollen, deren Einrechungs-Mails man abonnieren will, oder die man zu einem Blog kombinieren will), verwendet das Wiki eine PageSpec. Dies ist ein Ausdruck, der auf bestimmte Seiten passt.
es: Para seleccionar un conjunto de páginas, como páginas que están bloqueadas, páginas a cuyo envío de correo electrónico quiere suscribirse, o páginas para combinar en un blog, el wiki utiliza una PageSpec. Ésta consiste en una expresión que se corresponde con un conjunto de páginas.

source: The simplest PageSpec is a simple list of pages. For example, this matches any of the three listed pages:
de: Die einfachste PageSpec ist eine einfache Liste von Seiten. Zum Beispiel passt dies auf jede der drei aufgezählten Seiten:
es: La PageSpec más simple es una lista simple de páginas. Por ejemplo, ésta se corresponde con cualquiera de las tres páginas listadas:

source: More often you will want to match any pages that have a particular thing in their name. You can do this using a glob pattern. "`*`" stands for any part of a page name, and "`?`" for any single letter of a page name. So this matches all pages about music, and any [[SubPage]]s of the SandBox, but does not match the SandBox itself:
de: Häufiger wird es vorkommen, dass man Seiten erfassen will, deren Name etwas bestimmtes enthält. Man kann dies mit einem Muster tun: "`*`" steht für einen beliebigen Teil eines Seitennamens und "`?`" steht für einen beliebigen Buchstaben eines Seitennamens. Also passt dies alle Seiten über Musik, und alle [[Unterseiten|SubPage]] des Sandkastens, aber nicht auf den Sandkasten selbst:
es: A menudo querrá seleccionar cualquier página que tenga alguna particularidad en su nombre. Puede hacerlo utilizando un patrón «glob». "`*`" representa cualquier parte del nombre de una página, y "`?`" cualquier letra del nombre de una página. Así, esto se corresponde con todas las páginas sobre música, y cualquier [[subpágina|SubPage]] de la [[zona de pruebas («SandBox»)|SandBox]], pero no con la zona de pruebas («SandBox») misma:

source: You can also prefix an item with "`!`" to skip pages that match it. So to match all pages except for Discussion pages and the SandBox:
de: Man kann einem Eintrag ein "`!`" voranstellen, um die betreffenden Seiten auszuschließen. Auf diese Weise können alle Seiten außer Diskussionsseiten und Sandkasten erfasst werden:
es: También puede utilizar "`!`" delante de un elemento para que no se incluyan las páginas que se correspondan con ese elemento. Así, para seleccionar todas las páginas excepto las de Discusión y la Zona de pruebas («SandBox»):

source: Some more elaborate limits can be added to what matches using these functions:
de: Einige weitergehende Einschränkungen können hinzugefügt werden, indem die folgenden Funktionen verwendet werden:
es: Se pueden añadir límites más elaborados para seleccionar páginas utilizando estas funciones:

source: "`link(page)`" - matches only pages that link to a given page (or glob)
de: "`link(page)`" - passt nur auf Seiten, die einen Link auf die angegebene Seite (oder das angegebene Muster) enthalten
es: "`link(page)`" - selecciona solamente páginas que enlazan a una determiada página (o patrón «glob»)

source: "`tagged(tag)`" - matches pages that are tagged or link to the given tag (or tags matched by a glob)
de: "`tagged(tag)`" - passt nur auf Seiten, die mit dem angegebenen Tag versehen sind oder auf diesen verweisen (auch hier kann ein Muster verwendet werden)
es: "`tagged(tag)`" - selecciona páginas que están etiquetadas con o enlazadas a la etiqueta dada (o etiquetas que se corresponden con un patrón «glob»)

source: "`backlink(page)`" - matches only pages that a given page links to
de: "`backlink(page)`" - passt nur auf Seiten, auf die von der angegebenen Seite verwiesen wird
es: "`backlink(page)`" - selecciona solamente páginas a las que enlaza una página determinada

source: "`creation_month(month)`" - matches only pages created on the given month
de: "`creation_month(month)`" - passt nur auf Seiten, die im angegebenen Monat erstellt wurden
es: "`creation_month(month)`" - selecciona solamente páginas creadas en el mes dado

source: "`creation_day(mday)`" - or day of the month
de: "`creation_day(mday)`" - genauso für einen Tag im Monat
es: "`creation_day(mday)`" - o en el día del mes

source: "`creation_year(year)`" - or year
de: "`creation_year(year)`" - der ein Jahr
es: "`creation_year(year)`" - o en el año

source: "`created_after(page)`" - matches only pages created after the given page was created
de: "`created_after(page)`" - passt nur auf Seiten, die nach der angegebenen Seite angelegt wurden
es: "`created_after(page)`" - selecciona solamente páginas creadas después de que la página dada fuera creada

source: "`created_before(page)`" - matches only pages created before the given page was created
de: "`created_before(page)`" - passt nur auf Seiten, die vor der angegebenen Seite angelegt wurden.
es: "`created_before(page)`" - selecciona solamente páginas creadas antes de que la página dada fuera creada

source: "`glob(someglob)`" - matches pages that match the given glob. Just writing the glob by itself is actually a shorthand for this function.
de: "`glob(someglob)`" - passt nur auf Seiten, auf die das angegebene Muster passt. Das Muster direkt anzugeben ist eine Abkürzung für diese Funktion.
es: "`glob(someglob)`" - selecciona solamente páginas que se corresponden con el «glob» dado. Escribir simplemente el «glob» mismo es una abreviatura para esta función.

source: "`internal(glob)`" - like `glob()`, but matches even internal-use pages that globs do not usually match.
de: "`internal(glob)`" - wie `glob()`, aber es werden auch intern verwendete Seiten erfasst, auf die normale Muster nicht passen.
es: "`internal(glob)`" - como `glob()`, pero selecciona incluso páginas de uso interno, que los «globs» normalmente no seleccionan.

source: "`title(glob)`", "`author(glob)`", "`authorurl(glob)`", "`license(glob)`", "`copyright(glob)`" - match pages that have the given metadata, matching the specified glob.
de: "`title(glob)`", "`author(glob)`", "`authorurl(glob)`", "`license(glob)`", "`copyright(glob)`" - passt auf Seiten, deren Metadaten auf die angegebenen Muster passen.
es: "`title(glob)`", "`author(glob)`", "`authorurl(glob)`", "`license(glob)`", "`copyright(glob)`" - seleccionan páginas que contienen los metadatos dados, que se corresponden con el «glob» especificado.

source: "`user(username)`" - tests whether a modification is being made by a user with the specified username. If openid is enabled, an openid can also be put here.
es: "`user(username)`" - comprueba si se está haciendo una modificación por un usuario con el nombre de usuario especificado. Si openid está habilitado, también se puede usar aquí un openid.

source: "`admin()`" - tests whether a modification is being made by one of the wiki admins.
de: "`admin()`" - prüft ob eine Änderung durch einen der Wiki-Administratoren gemacht wird.
es: "`admin()`" - comprueba si se está haciendo una modificación por uno de los administradores del wiki.

source: "`ip(address)`" - tests whether a modification is being made from the specified IP address.
de: "`ip(address)`" - prüft ob eine Änderung von der angegebenen IP-Adresse aus gemacht wird.
es: "`ip(address)`" - comprueba si se está haciendo una modificación desde la dirección IP especificada.

source: "`postcomment(glob)`" - matches only when comments are being posted to a page matching the specified glob
de: "`postcomment(glob)`" - passt nur, wenn ein Kommentar zu einer durch das Muster angegebenen Seite gemacht wird
es: "`postcomment(glob)`" - selecciona solamente cuando se están poniendo comentarios a una página que se corresponde con el «glob» especificado

source: For example, to match all pages in a blog that link to the page about music and were written in 2005:
de: Zum Beispiel können alle Seiten eines Blogs ausgewählt werden, die einen Link zu einer Seite über Musik enthalten und 2005 geschrieben wurden:
es: Por ejemplo, para seleccionar todas las páginas de un blog que enlazan a la página sobre música y que fueron escritas en 2005:

source: blog/* and link(music) and creation_year(2005)
es: blog/* and link(música) and creation_year(2005)

source: Note the use of "and" in the above example, that means that only pages that match each of the three expressions match the whole. Use "and" when you want to combine expression like that; "or" when it's enough for a page to match one expression. Note that it doesn't make sense to say "index and SandBox", since no page can match both expressions.
de: Beachte die Verwendung von `and` im obigen Beispiel: Dies bewirkt, dass nur die Seiten auf den gesamten Ausdruck passen, die auf alle drei Teilausdrücke passen. Verwende `and` um Ausdrücke so zu kombinieren und `or` wenn eine Seite nur auf einen der Ausdrücke passen soll. Beachte dass es sinnlos ist, `index and SandBox` zu sagen, da keine Seite auf beide Ausdrücke passen kann.
es: Fíjese en el uso de "and" en el ejemplo anterior, que significa que sólo son seleccionadas las páginas que se corresponden con cada una de las tres expresiones. Utilice "and" cuando quiera combinar una expresión como ésa; utilice "or" cuando sea suficiente que una página se corresponda con una de las expresiones. Fíjese en que no tiene sentido decir "index and SandBox", puesto que ninguna página puede corresponderse con ambas expresiones.

source: More complex expressions can also be created, by using parentheses for grouping. For example, to match pages in a blog that are tagged with either of two tags, use:
de: Es können auch komplexere Ausdrücke erstellt werden, indem Klammern zur Gruppierung verwendet werden. Zum Beispiel passt der folgende Ausdruck auf Blog-Seiten, die mit einem der beiden angegebenen Tags versehen sind:
es: También se pueden crear expresiones más complejas, utilizando paréntesis para agruparlas. Por ejemplo, para seleccionar páginas de un blog que están etiquetadas con alguna de dos etiquetas, utilice:

source: Note that page names in PageSpecs are matched against the absolute filenames of the pages in the wiki, so a pagespec "foo" used on page "a/b" will not match a page named "a/foo" or "a/b/foo". To match relative to the directory of the page containing the pagespec, you can use "./". For example, "./foo" on page "a/b" matches page "a/foo".
de: Beachte, dass Seitennamen in PageSpecs auf den absoluten Dateinamen der Seiten im Wiki passen müssen: Die PageSpec `foo` auf der Seite `a/b` wird weder auf `a/foo` noch auf `a/b/foo` passen. Um relative Pfade zum Verzeichnis der Seite, die die PageSpec enthält, zu verwenden, kannst du `./` verwenden. Zum Beispiel passt `./foo` auf der Seite `a/b` auf `a/foo`.
es: Tenga en cuenta que los nombres de página en las PageSpecs se seleccionan según los nombre de archivo absolutos de las páginas del wiki, de tal modo que una «pagespec» "foo" utilizada en la página "a/b" no seleccionará una página llamada "a/foo" o "a/b/foo". Para seleccionar de manera relativa al directorio de la página que contiene la «pagespec», puede utilizar "./". Por ejemplo, "./foo" en la página "a/b" selecciona la página "a/foo".

source: "`user(username)`" - tests whether a modification is being made by a user with the specified username. If openid is enabled, an openid can also be put here. Glob patterns can be used in the username. For example, to match all openid users, use `user(*://*)`
de: "`user(username)`" - prüft ob eine Änderung von einem Benutzer mit dem angegebenen Namen gemacht wird. Wenn OpenID aktiviert ist, kann auch eine OpenID angegeben werden. Muster können im Benutzernamen verwendet werden. zum Beispiel können alle OpenID-Nutzer mit `user(*://*)` erfasst werden.
