Repository: privat/ikiwiki
Catalog: po/underlays/directives/ikiwiki/directive/if.*.po
Languages: de

source: The `if` directive is supplied by the [[!iki plugins/conditional desc=conditional]] plugin.
de: Die `if`-Anweisung wird durch die [[!iki plugins/conditional desc=conditional]]-Erweiterung bereitgestellt.

source: With this directive, you can make text be conditionally displayed on a page. For example:
de: Mit dieser Anweisung kann die Anzeige von Text an bestimmte Bedingungen geknüpft werden. Zum Beispiel:

source: \[[!if test="enabled(smiley)" then="The smiley plugin is enabled :-)" else="No smiley plugin here.."]]
de: \[[!if test="enabled(smiley)" then="Die smiley-Erweiterung ist aktiviert :-)" else="Hier gibt es keine smiley-Erweiterung &hellip;"]]

source: If the specified `test` succeeds, the `then` text will be displayed, otherwise the `else` text will be displayed. The `else` part is optional.
de: Wenn der angegebene `test` erfolgreich ist, wird der `then`-Text angezeigt, sonst der `else`-Text. Der `else`-Teil ist optional.

source: The `then` and `else` values can include any markup that would be allowed in the wiki page outside the template. Triple-quoting the values even allows quotes to be included.
de: Die Werte für `then` und `else` können beliebige Formatierungsanweisungen enthalten, die außerhalb der Anweisung erlaubt wären. Werten die Werte durch dreifache Anführungszeichen abgetrennt, können sie sogar Anführungszeichen enthalten.

source: The `test` is a [[ikiwiki/PageSpec]]; if it matches any page in the wiki then it succeeds. So you can do things like testing for the existence of a page or pages, testing to see if any pages were created in a given month, and so on.
de: Der `test` ist eine [[ikiwiki/PageSpec]]; wenn sie auf irgendeine Seite im Wiki passt, hat der Test Erfolg. Dadurch kann man die Existenz einer oder mehrerer Seiten überprüfen, überprüfen ob in einem bestimmten Monat Seiten angelegt wurden, und so weiter.

source: If you want the [[ikiwiki/PageSpec]] to only match against the page that contains the conditional, rather than matching against all pages in the wiki, set the "all" parameter to "no".
de: Wenn die [[ikiwiki/PageSpec]] nur auf die aktuelle Seite angewendet werden soll, die die Bedingung enthält (und nicht auf alle Seiten im Wiki), kann der optionale `all`-Parameter auf `no` gesetzt werden.

source: In an `if` directive, the regular [[ikiwiki/PageSpec]] syntax is expanded with the following additional tests:
de: In einer `if`-Anweisung sind neben der regulären [[ikiwiki/PageSpec]]-Syntax die folgenden zusätzlichen Test verfügbar:

source: Tests whether the specified plugin is enabled.
de: Prüft, ob die angegebene Erweiterung aktiviert ist.

source: Tests whether the glob matches the name of the page that contains the conditional.
de: Prüft, ob das angegebene Muster auf den Namen der Seite passt, die die Bedingung enthält.

source: Tests whether the glob matches the name of the page that is being built. That might be different than the name of the page that contains the conditional, if it's being inlined into another page.
de: Prüft, ob das Muster auf den namen der Seite passt, die gerade erzeugt wird. Dies kann ein anderer Name sein als der der Seite, die die Bedingung enthält, wenn diese über [[inline]] in eine andere Seite eingebunden wird.

source: Tests whether the page is being included onto another page.
de: Prüft, ob die Seite gerade in eine andere eingebunden wird.
