Repository: privat/ikiwiki
Catalog: po/underlays/basewiki/templates.*.po
Languages: cs, es

source: [[!if test="enabled(template)" then="This wiki has templates **enabled**." else="This wiki has templates **disabled**." ]]
cs: [[!if test="enabled(template)" then="Tato wiki má šablony **povolené**." else="Tato wiki má šablony **vypnuté**." ]]
es: [[!if test="enabled(template)" then="Este wiki tiene las plantillas **activadas**." else="Este wiki tiene las plantillas **desactivadas**." ]]

source: Templates are files that can be filled out and inserted into pages in the wiki.
cs: Šablony jsou soubory, které je možno vyplnit a vložit do stránek ve wiki.
es: Las plantillas son archivos que se pueden completar e insertar en páginas del wiki.

source: These templates are available for inclusion onto other pages in this wiki:
cs: V této wiki jsou k dispozici následující šablony:
es: Estas plantillas están disponibles en este wiki para ser incluidas en otras páginas:

source: Using a template
cs: Používání šablon
es: Uso de una plantilla

source: Using a template works like this:
cs: Použití šablony vypadá následovně:
es: El uso de una plantilla es así:

source: \[[!template id=note text="""Here is the text to insert into my note."""]]
cs: \[[!template id=note text="""Text pro vložení do poznámky."""]]
es: \[[!template id=note text="""Éste es el texto que se insertará en mi nota."""]]

source: This fills out the [[note]] template, filling in the `text` field with the specified value, and inserts the result into the page.
cs: Tímto se v šabloně [[note]] vyplní pole `text` zadanou hodnotou a výsledek se vloží do stránky.
es: Esto rellena la plantilla [[note]] («nota»), completando el campo `text` («texto») con el valor especificado, e inserta el resultado en la página.

source: Generally, a value can include any markup that would be allowed in the wiki page outside the template. Triple-quoting the value even allows quotes to be included in it. Combined with multi-line quoted values, this allows for large chunks of marked up text to be embedded into a template:
cs: Hodnota může obsahovat libovolné značky, které jsou povoleny v běžné wiki stránce. Trojité uvozovky dokonce umožňují používat uvnitř hodnoty i běžné anglické uvozovky. V kombinaci s viceřádkovými hodnotami lze do šablony vložit poměrně velké kusy označkovaného textu:
es: Por lo general, un valor puede incluir cualquier marcado («markup») permitido en la página wiki fuera de la plantilla. La utilización de comillas triples permite incluso que se incluyan comillas. En combinación con valores entrecomillados en múltiples líneas, esto permite que se incluyan grandes fragmentos de texto marcado en una plantilla:

source: \[[!template id=foo name="Sally" color="green" age=8 notes="""
cs: \[[!template id=foo name="Sally" color="zelená" age=8 notes="""

source: \[[Charley]]'s sister.
cs: \[[Charlieho|Charley]] sestra.
es: Hermana de \[[Charley]].

source: "I want to be an astronaut when I grow up."
cs: "Až vyrostu, chci být kosmonautem."
es: "Quiero ser astronauta cuando crezca."

source: Really 8 and a half.
cs: Opravdu, 8 a půl.
es: 8 y medio en realidad.

source: Creating a template
cs: Vytvoření šablony
es: Creación de una plantilla

source: To create a template, simply add a template directive to a page, and the page will provide a link that can be used to create the template. The template is a regular wiki page, located in the `templates/` subdirectory inside the source directory of the wiki.
cs: Pro vytvoření šablony jednoduše přidejte do stránky direktivu template a stránka poskytne odkaz, který se dá použít pro vytvoření šablony. Šablona je běžná wiki stránka umístěná ve zdrojovém adresáři wiki v podadresáři `templates/`.
es: Para crear una plantilla, simplemente añada una directiva de plantilla a una página, y ésta proporcionará un enlace que puede utilizarse para crear la plantilla. La plantilla es una página wiki normal, situada en el subdirectorio `templates/` dentro del directorio fuente del wiki.

source: The template uses the syntax used by the [[!cpan HTML::Template]] perl module, which allows for some fairly complex things to be done. Consult its documentation for the full syntax, but all you really need to know are a few things:
cs: Šablona používá stejnou syntaxi jako perlový modul [[!cpan HTML::Template]], což umožňuje provádět poměrně komplexní věci. Úplný popis syntaxe naleznete v dokumentaci modulu, ale ve skutečnosti stačí znát jen pár věcí:
es: La plantilla utiliza la sintaxis usada por el módulo perl [[!cpan HTML::Template]], que permite hacer algunas cosas bastante complejas. Consulte su documentación para ver la sintaxis completa, pero todo lo que realmente necesita saber son unas pocas cosas:

source: Each parameter you pass to the template directive will generate a template variable. There are also some pre-defined variables like PAGE and BASENAME.
cs: Každý parametr, který předáte direktivě template, vygeneruje proměnnou šablony. Existuje několik předdefinovaných proměnných jako PAGE a BASENAME.
es: Cada parámetro que pase a la directiva de plantilla generará una variable de plantilla. También existen algunas variables predefinidas como PAGE y BASENAME.

source: To insert the value of a variable, use `<TMPL_VAR variable>`. Wiki markup in the value will first be converted to html.
cs: Pro vložení hodnoty proměnné použijte `<TMPL_VAR proměnná>`. Wiki značky v hodnotě budou nejprve převedeny na html.
es: Para introducir el valor de una variable, utilice `<TMPL_VAR variable>`. El marcado («markup») wiki en el valor será convertido primero a html.

source: To insert the raw value of a variable, with wiki markup not yet converted to html, use `<TMPL_VAR raw_variable>`.
cs: Chcete-li vložit hodnotu proměnné bez dalších úprav (bez převodu na html), použijte `<TMPL_VAR raw_proměnná>`.
es: Para insertar el valor sin procesar de una variable, con el marcado wiki no convertido todavía a html, utilice `<TMPL_VAR raw_variable>`.

source: To make a block of text conditional on a variable being set use `<TMPL_IF NAME="variable">text</TMPL_IF>`.
cs: Chcete-li blok textu zobrazit pouze pokud je nastavena příslušná proměnná, použijte `<TMPL_IF NAME="proměnná">text</TMPL_IF>`.
es: Para que un bloque de texto dependa de que una variable haya sido establecida, utilice `<TMPL_IF NAME="variable">texto</TMPL_IF>`.

source: To use one block of text if a variable is set and a second if it's not, use `<TMPL_IF NAME="variable">text<TMPL_ELSE>other text</TMPL_IF>`
cs: Chcete-li použít jeden blok textu v případě, že je proměnná nastavená, a jiný blok textu pokud nastavená není, použijte `<TMPL_IF NAME="proměnná">text<TMPL_ELSE>jiný text</TMPL_IF>`.
es: Para utilizar un bloque de texto si se ha establecido una variable, y otro texto si no se ha establecido, utilice `<TMPL_IF NAME="variable">texto<TMPL_ELSE>otro texto</TMPL_IF>`

source: Here's a sample template:
cs: Ukázková šablona:
es: Esto es una plantilla de ejemplo:

source: <span class="infobox"> Name: \[[<TMPL_VAR raw_name>]]<br /> Age: <TMPL_VAR age><br /> <TMPL_IF NAME="color"> Favorite color: <TMPL_VAR color><br /> <TMPL_ELSE> No favorite color.<br /> </TMPL_IF> <TMPL_IF NAME="notes"> <hr /> <TMPL_VAR notes> </TMPL_IF> </span>
cs: <span class="infobox"> Jméno: \[[<TMPL_VAR raw_name>]]<br /> Věk: <TMPL_VAR age><br /> <TMPL_IF NAME="color"> Oblíbená barva: <TMPL_VAR color><br /> <TMPL_ELSE> Žádná oblíbená barva.<br /> </TMPL_IF> <TMPL_IF NAME="notes"> <hr /> <TMPL_VAR notes> </TMPL_IF> </span>
es: <span class="infobox"> Nombre: \[[<TMPL_VAR raw_name>]]<br /> Edad: <TMPL_VAR age><br /> <TMPL_IF NAME="color"> Color favorito: <TMPL_VAR color><br /> <TMPL_ELSE> Ningún color favorito.<br /> </TMPL_IF> <TMPL_IF NAME="notes"> <hr /> <TMPL_VAR notes> </TMPL_IF> </span>

source: The filled out template will be formatted the same as the rest of the page that contains it, so you can include WikiLinks and all other forms of wiki markup in the template. Note though that such WikiLinks will not show up as backlinks to the page that uses the template.
cs: Vyplněná šablona bude formátována stejně jako zbytek stránky, do které je vložena, tudíž můžete v šabloně používat wiki linky a všechny obvyklé formátovací značky. Změnou je, že se wiki linky neobjeví jako zpětné odkazy na stránku, která šablonu použila.
es: La plantilla rellenada se formateará de la misma manera que el resto de la página que la contiene, así que puede incluir WikiLinks («enlaces wiki») y todas las otras formas de marcado wiki en la plantilla. Sin embargo, tenga en cuenta que estos WikiLinks no aparecerán como «backlinks» a la página que usa la plantilla.

source: Note the use of "raw_name" inside the [[ikiwiki/WikiLink]] generator. This ensures that if the name contains something that might be mistaken for wiki markup, it's not converted to html before being processed as a [[ikiwiki/WikiLink]].
cs: Všimněte si použití „raw_name“ uvnitř generátoru [[wiki odkazu|ikiwiki/WikiLink]]. Tímto se zajistí, že pokud by jméno obsahovalo něco, co by mohlo být považováno za formátovací wiki značku, nebude to převedeno na html před vytvořením [[wiki odkazu|ikiwiki/WikiLink]].
es: Tenga en cuenta el uso de «raw_name» dentro del generador de [[ikiwiki/WikiLink]]. Esto asegura que si el nombre contiene algo que pueda ser tomado equivocadamente como marcado wiki, no sea convertido a html antes de ser procesado como un [[ikiwiki/WikiLink]].
